snlkuharlocal/src/DataProcessors/ЗаполнениеЗаказовФБСМаркиовкой/ЗаполнениеЗаказовФБСМаркиовкой.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеЗаказовФБСМаркиовкой</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЗаказыFBSМаркировка/ЗаказыFBSМаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаказыFBSМаркировка</name>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказFBS</name>
    <type>
      <types>DocumentRef.ЗаказКлиентаFBS</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаказКлиентаFBS/ЗаказКлиентаFBS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказКлиентаFBS</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛистПереукладки</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрефиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуффиксЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РИД</name>
      <comment>идентификатор вайлдб. для обмена.</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусWB</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗаказа</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеУКлиента</name>
      <type>
        <types>CatalogRef.СостояниеНакладнойУКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтменаОтработана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТрэкНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогистСервис</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркОфис</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВычеркСклад</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПереданоНаСайт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ШтрихкодыУпаковокТоваров/ШтрихкодыУпаковокТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихкодыУпаковокТоваров</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ДатаУпаковки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКМ</name>
    <type>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеШтрихкода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодировкаШтрихкода</name>
    <type>
      <types>EnumRef.ТипыКодировокШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Количество в базовых единицах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партия</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКода</name>
    <type>
      <types>EnumRef.ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособВводаВОборот</name>
    <type>
      <types>EnumRef.СпособыВводаВОборотСУЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВложенныеШтрихкоды</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ЗаполнениеЗаказовФБСМаркиовкой/ManagerModule.bsl
// Ихсанов Д. А. 25.06.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2315
// Были внесены изменения в обработку 26.06.2025
// Можно просто полностью обновить модуль, здесь только мой функционал

#Область ПрограммныйИнтерфейс

#Область МП_ЯндексМаркет

// Ихсанов Д. А. Начало 28.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1949
// Процедура - Отправить маркировку яндекс маркет
//
// Параметры:
//  МаркетПлейс	- СправочникСсылка.ИнетМагазины - Ссылка на МаркетПлейс.
//
Процедура МП_ЯндексМаркет_ОтправитьМаркировку(МаркетПлейс) Экспорт
	
	пРеквизитыМаркетПлейс = ЗначенияРеквизитовОбъекта(МаркетПлейс, 
		"Контрагент, Наименование, ИДКомпании");
	
	// Состояние промаркированного товара
	Состояние_Промаркировано = МП_ЯндексМаркет_СостояниеПромаркированнойПродукции();
	
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить("ВЫБРАТЬ
	|	ЗаказыFBSМаркировка.ЗаказFBS КАК ЗаказFBS,
	|	ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование КАК РасходнаяНакладная,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЗаказКлиентаFBSТовары.РИД КАК НомерЗаказаВМоделиСервиса,
	|	ЗаказКлиентаFBSТовары.АртикулКонтрагента КАК АртикулКонтрагента,
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	|	ЗаказКлиентаFBSТовары.Количество КАК Количество,
	|	ЗаказКлиентаFBSТовары.СостояниеУКлиента КАК СостояниеУКлиента
	|ПОМЕСТИТЬ вт_Заказы
	|ИЗ
	|	РегистрСведений.ЗаказыFBSМаркировка КАК ЗаказыFBSМаркировка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|		ПО ЗаказыFBSМаркировка.ЗаказFBS = ЗаказКлиентаFBS.Ссылка
	|			И (ЗаказКлиентаFBS.Дата > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -3))
	|			И (ЗаказКлиентаFBS.Контрагент = &Контрагент)
	|			И (НЕ ЗаказКлиентаFBS.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО ЗаказыFBSМаркировка.ЗаказFBS = ЗаказКлиентаFBSТовары.Ссылка
	|			И (НЕ ЗаказыFBSМаркировка.Обработан)
	|			И (НЕ ЗаказКлиентаFBSТовары.Отменен)
	|ГДЕ
	|	ЗаказКлиентаFBSТовары.СостояниеУКлиента = &СостояниеУКлиента");
	ТекстыЗапросов.Добавить(МП_ЯндексМаркет_ТекстЗапросаДанныеМаркировкиЗаказов("вт_Заказы"));
	ТекстыЗапросов.Добавить("ВЫБРАТЬ * ИЗ вт_Результат ГДЕ СостояниеНакладной В (
	// Ихсанов Д. А. Начало 07.07.2026 Изменение 0000000087 от 07.06.2026 22:19:02: e1cib/data/Документ.Изменение?ref=89690050568f680711f162a5bd350d2d
	//|		ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ОжиданиеПаллетирования),
	//|		ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Паллетирование))
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ГотоваКОтгрузке),
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Отгружена))
	// Ихсанов Д. А. Конец 07.07.2026
	|ИТОГИ ПО ЗаказFBS, НомерЗаказа, Идентификатор");
	
	Запрос = Новый Запрос(СтрСоединить(ТекстыЗапросов, ";" + Символы.ПС));
	Запрос.УстановитьПараметр("ТекущаяДата",	   ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Контрагент",		   пРеквизитыМаркетПлейс.Контрагент);
	Запрос.УстановитьПараметр("СостояниеУКлиента", Справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию("PROCESSING;STARTED"));
	
	ВыборкаЗаказFBS = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаЗаказFBS.Следующий() Цикл
		// Инициализируем массив для хранения номера заказа и идентификатора товара
		ОбработанныеЗаказы = Новый Соответствие;
		ОбработанныеДанныеЗаказа = Новый Массив;
		
		// Формируем данные по коробкам для отправки
		ВыборкаНомерЗаказа = ВыборкаЗаказFBS.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНомерЗаказа.Следующий() Цикл
			// Получаем структуру, для перевода ее в формат JSON
			ДанныеДляJSON = МП_ЯндексМаркет_СформироватьСтруктуруДанныхПоВыборке(ВыборкаНомерЗаказа, ОбработанныеДанныеЗаказа);
			
			ПараметрыОбработки = ОбменМаркетПлейс.ПолучитьОбщиеПараметрыОбработки();
			ПараметрыОбработки.ДанныеЗапроса.Метод		 = "PUT";
			ПараметрыОбработки.ДанныеЗапроса.ТелоЗапроса = ОбменМаркетПлейс.СформироватьСтрокуJSON(ДанныеДляJSON,
				ПараметрыОбработки);
			ДанныеОтвета = ОбменМаркетПлейс.ВыполнитьИОбработатьЗапросВМоделиСервиса(
				ОбменМаркетПлейс.МП_Яндекс_ВернутьСоединение(МаркетПлейс),
				ОбменМаркетПлейс.МП_Яндекс_ВернутьЗаголовкиHTTP(МаркетПлейс),
				СтрШаблон("/v2/campaigns/%1/orders/%2/boxes.json", пРеквизитыМаркетПлейс.ИДКомпании, ВыборкаНомерЗаказа.НомерЗаказа),
				ПараметрыОбработки);
			
			ДанныеМаркировкиОтправлены = ДанныеОтвета.Свойство("status") И ДанныеОтвета.status = "OK";
			
			// Фиксируем факт ошибки отправки данных маркировки по заказу даже в случае,
			// если часть заказов обработалась нормально
			Если ОбработанныеЗаказы[ВыборкаЗаказFBS.ЗаказFBS] = Неопределено
				Или Не ДанныеМаркировкиОтправлены Тогда
				ОбработанныеЗаказы.Вставить(ВыборкаЗаказFBS.ЗаказFBS);
				ОбработанныеЗаказы[ВыборкаЗаказFBS.ЗаказFBS] = ДанныеМаркировкиОтправлены;
			КонецЕсли;
		КонецЦикла;
		
		// Желательно унести блок в модуль менеджера
		// Записываем в базу кэшированные данные по заказам клиентов FBS
		Для каждого лЗаказFBS из ОбработанныеЗаказы Цикл
			// Если заказ не обработан, либо обработан не полностью, переходим к следующему
			Если Не лЗаказFBS.Значение Тогда
				Продолжить;
			КонецЕсли;
			
			// Если заказ был успешно обработан, фиксируем факт обработки в базу
			МенеджерЗаписиМаркировка = РегистрыСведений.ЗаказыFBSМаркировка.СоздатьМенеджерЗаписи();
			МенеджерЗаписиМаркировка.ЗаказFBS = лЗаказFBS.Ключ;
			МенеджерЗаписиМаркировка.Прочитать();
			
			Если Не МенеджерЗаписиМаркировка.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаказFBSОбъект = лЗаказFBS.Ключ.ПолучитьОбъект();
			
			// Меняем статус у каждого обработанного товара в документе заказа на CUSTOM:MARKED
			Для каждого ПараметрыОтбора из ОбработанныеДанныеЗаказа Цикл
				НайденныеСтроки = ЗаказFBSОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
				Для каждого СтрокаЗаказа из НайденныеСтроки Цикл
					СтрокаЗаказа.СостояниеУКлиента = Состояние_Промаркировано;
				КонецЦикла;
			КонецЦикла;
			
			Попытка
				ЗаказFBSОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				МенеджерЗаписиМаркировка.Обработан = Истина;
				МенеджерЗаписиМаркировка.Записать();
			Исключение
				// Если документ или регистр не записался, отдаем в лог ошибку
				// Важно понимать, что в регистре одно измерение и без замещения ошибка по нему
				// появляться не должна
				Шаблон_СообщениеОбОшибке = НСтр("ru=''%1. Не удалось зафиксировать данные по документу %2!
					|Возникла ошибка при записи данных после отправки маркировки:
					|%3'", "ru");
				СообщениеОбОшибке = СтрШаблон(Шаблон_СообщениеОбОшибке, "ЗаполнениеЗаказовФБСМаркиовкой",
					ЗаказFBSОбъект, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписатьВЛог("МП_ЯндексМаркет", СообщениеОбОшибке, "Ошибка");
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // ПрикрепитьМаркуЯндексМаркет()
// Ихсанов Д. А. Конец  28.01.2025

#КонецОбласти

#Область МП_МагнитМаркет

// Ихсанов Д. А. Начало 25.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1102
// Процедура - Отправить маркировку яндекс маркет
//
// Параметры:
//  МаркетПлейс	- СправочникСсылка.ИнетМагазины - Ссылка на МаркетПлейс.
//
Процедура МП_МагнитМаркет_ОтправитьМаркировку(МаркетПлейс) Экспорт
	
	пРеквизитыМаркетПлейс = ЗначенияРеквизитовОбъекта(МаркетПлейс, 
		"Контрагент, Наименование, ИДКомпании");
	
	// Состояние промаркированного товара
	Состояние_Промаркировано = МП_МагнитМаркет_СостояниеПромаркированнойПродукции();
	
	// Получаем данные по штрихкодам товаров в РНК
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить("ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ЗаказыFBSМаркировка.ЗаказFBS КАК ЗаказFBS,
	|	ЗаказыFBSМаркировка.ЗаказFBS.ДокОснование КАК РасходнаяНакладная,
	|	ЗаказКлиентаFBSТовары.НомерЗаказа КАК НомерЗаказа,
	|	ЗаказКлиентаFBSТовары.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЗаказКлиентаFBSТовары.РИД КАК НомерЗаказаВМоделиСервиса,
	|	ЗаказКлиентаFBSТовары.СостояниеУКлиента КАК СостояниеУКлиента,
	|	ЗаказКлиентаFBSТовары.АртикулКонтрагента КАК АртикулКонтрагента,
	|	ЗаказКлиентаFBSТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаFBSТовары.ШтрихКод КАК ШтрихКод,
	|	ЗаказКлиентаFBSТовары.Количество КАК Количество
	|ПОМЕСТИТЬ вт_Заказы
	|ИЗ
	|	РегистрСведений.ЗаказыFBSМаркировка КАК ЗаказыFBSМаркировка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS КАК ЗаказКлиентаFBS
	|		ПО ЗаказыFBSМаркировка.ЗаказFBS = ЗаказКлиентаFBS.Ссылка
	|			И (ЗаказКлиентаFBS.Дата > ДОБАВИТЬКДАТЕ(&ТекущаяДата, ДЕНЬ, -3))
	|			И (ЗаказКлиентаFBS.Контрагент = &Контрагент)
	|			И (НЕ ЗаказКлиентаFBS.ПометкаУдаления)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиентаFBS.Товары КАК ЗаказКлиентаFBSТовары
	|		ПО ЗаказыFBSМаркировка.ЗаказFBS = ЗаказКлиентаFBSТовары.Ссылка
	|			И (НЕ ЗаказыFBSМаркировка.Обработан)
	|			И (НЕ ЗаказКлиентаFBSТовары.Отменен)");
	ТекстыЗапросов.Добавить(МП_МагнитМаркет_ТекстЗапросаДанныеМаркировкиЗаказов("вт_Заказы"));
	ТекстыЗапросов.Добавить("ВЫБРАТЬ вт_Результат.*, вт_Заказы.НомерЗаказа КАК НомерЗаказаВДокументе ИЗ вт_Результат
	|ЛЕВОЕ СОЕДИНЕНИЕ вт_Заказы КАК вт_Заказы
	|ПО вт_Результат.НомерЗаказа = вт_Заказы.НомерЗаказаВМоделиСервиса
	|	И вт_Результат.Идентификатор = вт_Заказы.АртикулКонтрагента ГДЕ СостояниеНакладной В ( 
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ОжиданиеПаллетирования),
	|		ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.Паллетирование))
	|ИТОГИ МАКСИМУМ(вт_Результат.НомерЗаказа), МАКСИМУМ(вт_Результат.СуффиксЗаказа)
	|ПО вт_Результат.ЗаказFBS, НомерЗаказаВДокументе, Идентификатор");
	
	Запрос = Новый Запрос(СтрСоединить(ТекстыЗапросов, ";" + Символы.ПС));
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Контрагент",  пРеквизитыМаркетПлейс.Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗаказFBS");
	Пока Выборка.Следующий() Цикл
		// Инициализируем массив для хранения номера заказа и идентификатора товара
		ОбработанныеЗаказы = Новый Соответствие;
		ОбработанныеДанныеЗаказа = Новый Массив;
		
		// Формируем данные по коробкам для отправки
		ВыборкаНомераЗаказов = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерЗаказаВДокументе");
		Пока ВыборкаНомераЗаказов.Следующий() Цикл
			// Получаем структуру, для перевода ее в формат JSON
			ДанныеДляJSON = МП_МагнитМаркет_СформироватьСтруктуруДанныхПоВыборке(ВыборкаНомераЗаказов, 
				ОбработанныеДанныеЗаказа);
			
			ПараметрыОбработки = ОбменМаркетПлейс.ПолучитьОбщиеПараметрыОбработки();
			ПараметрыОбработки.ДанныеЗапроса.Метод = "POST";
			ПараметрыОбработки.ДанныеЗапроса.ТелоЗапроса = ОбменМаркетПлейс.СформироватьСтрокуJSON(ДанныеДляJSON, 
				ПараметрыОбработки);
			
			ДанныеОтвета = ОбменМаркетПлейс.ВыполнитьИОбработатьЗапросВМоделиСервиса(
				ОбменМаркетПлейс.МП_Магнит_ВернутьСоединение(МаркетПлейс),
				ОбменМаркетПлейс.МП_Магнит_ВернутьЗаголовкиHTTP(МаркетПлейс),
				Обработки.МП_ММ_МагнитМаркет.МП_АдресЗапроса_ПередатьМаркировку(),
				ПараметрыОбработки);
			
			// Получаем и обрабатываем информацию о статусе заказа
			ДанныеМаркировкиОтправлены = Не (ДанныеОтвета.Свойство("error")
				Или ДанныеОтвета.Свойство("errors"));
			
			// Фиксируем факт ошибки отправки данных маркировки по заказу даже в случае,
			// если часть заказов обработалась нормально
			Если ОбработанныеЗаказы[ВыборкаНомераЗаказов.ЗаказFBS] = Неопределено
				Или Не ДанныеМаркировкиОтправлены Тогда
				ОбработанныеЗаказы.Вставить(ВыборкаНомераЗаказов.ЗаказFBS);
				ОбработанныеЗаказы[ВыборкаНомераЗаказов.ЗаказFBS] = ДанныеМаркировкиОтправлены;
			КонецЕсли;
		КонецЦикла;
		
		// Желательно унести блок в модуль менеджера
		// Записываем в базу кэшированные данные по заказам клиентов FBS
		Для каждого лЗаказFBS из ОбработанныеЗаказы Цикл
			// Если заказ не обработан, либо обработан не полностью, переходим к следующему
			Если Не лЗаказFBS.Значение Тогда
				Продолжить;
			КонецЕсли;
			
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический);
			
			// Если заказ был успешно обработан, фиксируем факт обработки в базу
			МенеджерЗаписиМаркировка = РегистрыСведений.ЗаказыFBSМаркировка.СоздатьМенеджерЗаписи();
			МенеджерЗаписиМаркировка.ЗаказFBS = лЗаказFBS.Ключ;
			МенеджерЗаписиМаркировка.Прочитать();
			
			Если Не МенеджерЗаписиМаркировка.Выбран() Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаказFBSОбъект = лЗаказFBS.Ключ.ПолучитьОбъект();
			
			// Меняем статус у каждого обработанного товара в документе заказа на IN_ASSEMBLY;MARKED
			Для каждого ПараметрыОтбора из ОбработанныеДанныеЗаказа Цикл
				НайденныеСтроки = ЗаказFBSОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
				Для каждого СтрокаЗаказа из НайденныеСтроки Цикл
					СтрокаЗаказа.СостояниеУКлиента = Состояние_Промаркировано;
				КонецЦикла;
			КонецЦикла;
			
			Попытка
				ЗаказFBSОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
				МенеджерЗаписиМаркировка.Обработан = Истина;
				МенеджерЗаписиМаркировка.Записать();
				
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
				
				// Если документ или регистр не записался, отдаем в лог ошибку
				// Важно понимать, что в регистре одно измерение и без замещения ошибка по нему
				// появляться не должна
				Шаблон_СообщениеОбОшибке = НСтр("ru=''%1. Не удалось зафиксировать данные по документу %2!
					|Возникла ошибка при записи данных после отправки маркировки:
					|%3'", "ru");
				СообщениеОбОшибке = СтрШаблон(Шаблон_СообщениеОбОшибке, "ЗаполнениеЗаказовФБСМаркиовкой",
					ЗаказFBSОбъект, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписатьВЛог("МП_МагнитМаркет", СообщениеОбОшибке, "Ошибка");
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;     	
	
КонецПроцедуры // ПрикрепитьМаркуЯндексМаркет()
// Ихсанов Д. А. Конец  25.03.2025

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Текст запроса данные маркировки заказов
// Определено в СквозноеТестирование().
//
// Параметры:
//  ИмяВременнойТаблицы	 - Строка - Имя, уже определенной в начале текста запроса, временной таблицы.
// 
// Возвращаемое значение:
//  Строка - Пакетный запрос, оканчивающийся временной таблицей.
//
Функция МП_ТекстЗапросаДанныеМаркировкиЗаказов(ИмяВременнойТаблицы) Экспорт
	
	// Этот текст запроса конкатенируется с текстом сбора данных о заказах
	// См. подробнее в МодульМенеджера Обработка.ЗаполнениеЗаказовФБСМаркиовкой.МП_ЯндексМаркет_ОтправитьМаркировку()
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт_Заказы.ЗаказFBS КАК ЗаказFBS,
	|	вт_Заказы.РасходнаяНакладная КАК РасходнаяНакладная,
	|	ЛистНабораШтрихкодыУпаковок.Ссылка КАК ЛистНабора,
	|	вт_Заказы.НомерЗаказа КАК НомерЗаказа,
	|	вт_Заказы.СуффиксЗаказа КАК СуффиксЗаказа,
	|	вт_Заказы.НомерЗаказаВМоделиСервиса КАК НомерЗаказаВМоделиСервиса,
	|	вт_Заказы.АртикулКонтрагента КАК АртикулКонтрагента,
	|	вт_Заказы.Номенклатура КАК Номенклатура,
	|	вт_Заказы.ШтрихКод КАК ШтрихКод,
	|	вт_Заказы.Количество КАК Количество,
	|	ДокументРасходнаяНакладная.СостояниеНакладной КАК СостояниеНакладной,
	|	вт_Заказы.СостояниеУКлиента КАК СостояниеУКлиента
	|ПОМЕСТИТЬ вт_ЛистыНабора
	|ИЗ
	|	%1 КАК вт_Заказы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная КАК ДокументРасходнаяНакладная
	|		ПО вт_Заказы.РасходнаяНакладная = ДокументРасходнаяНакладная.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|		ПО вт_Заказы.РасходнаяНакладная = ЛистНабораШтрихкодыУпаковок.Ссылка.ДокОснование
	|			И вт_Заказы.НомерЗаказа = ЛистНабораШтрихкодыУпаковок.НомерЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораТовары.Ссылка КАК Ссылка,
	|	ЛистНабораТовары.Номенклатура КАК Номенклатура,
	|	ЛистНабораТовары.ШК КАК ШК,
	|	ЛистНабораТовары.ПорядковыйНомерКоробки КАК ПорядковыйНомерКоробки
	|ПОМЕСТИТЬ вт_ЛистНабораТовары
	|ИЗ
	|	вт_ЛистыНабора КАК вт_ЛистыНабора
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЛистНабора.Товары КАК ЛистНабораТовары
	|		ПО вт_ЛистыНабора.ЛистНабора = ЛистНабораТовары.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛистНабораТовары.Ссылка,
	|	ЛистНабораТовары.Номенклатура,
	|	ЛистНабораТовары.ШК,
	|	ЛистНабораТовары.ПорядковыйНомерКоробки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЛистНабораШтрихкодыУпаковок.Ссылка КАК Ссылка,
	|	ЛистНабораШтрихкодыУпаковок.НомерЗаказа КАК НомерЗаказа,
	|	ШтрихкодыУпаковокТоваров.Наименование КАК Наименование,
	|	ШтрихкодыУпаковокТоваров.Владелец КАК Номенклатура
	|ПОМЕСТИТЬ вт_ШтрихкодыУпаковокТоваров
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ЛистНабораШтрихкодыУпаковок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|		ПО (ВЫБОР
	|				КОГДА ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
	|					ТОГДА ЛистНабораШтрихкодыУпаковок.ШтрихкодУпаковки
	|				ИНАЧЕ ЛистНабораШтрихкодыУпаковок.ШтрихкодНабора
	|			КОНЕЦ = ШтрихкодыУпаковокТоваров.Ссылка)
	|ГДЕ
	|	(ЛистНабораШтрихкодыУпаковок.Ссылка, ЛистНабораШтрихкодыУпаковок.НомерЗаказа) В
	|			(ВЫБРАТЬ
	|				вт_ЛистыНабора.ЛистНабора,
	|				вт_ЛистыНабора.НомерЗаказа
	|			ИЗ
	|				вт_ЛистыНабора)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_ЛистыНабора.ЗаказFBS КАК ЗаказFBS,
	|	вт_ЛистыНабора.НомерЗаказаВМоделиСервиса КАК НомерЗаказа,
	// Ихсанов Д. А. Начало 18.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
	|	вт_ЛистыНабора.НомерЗаказа КАК НомерЗаказаСИндексом,
	// Ихсанов Д. А. Конец 18.12.2025
	|	вт_ЛистыНабора.СуффиксЗаказа КАК СуффиксЗаказа,
	|	ЕСТЬNULL(вт_ШтрихкодыУпаковокТоваров.Наименование, """") КАК КИЗ,
	|	ЕСТЬNULL(вт_ЛистНабораТовары.ПорядковыйНомерКоробки, 0) КАК НомерКоробки,
	|	вт_ЛистыНабора.АртикулКонтрагента КАК Идентификатор,
	|	СУММА(вт_ЛистыНабора.Количество) КАК Количество,
	|	вт_ЛистыНабора.СостояниеНакладной КАК СостояниеНакладной,
	|	вт_ЛистыНабора.СостояниеУКлиента КАК СостояниеУКлиента
	|ПОМЕСТИТЬ вт_Результат
	|ИЗ
	|	вт_ЛистыНабора КАК вт_ЛистыНабора
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ЛистНабораТовары КАК вт_ЛистНабораТовары
	|		ПО вт_ЛистыНабора.ЛистНабора = вт_ЛистНабораТовары.Ссылка
	|			И вт_ЛистыНабора.Номенклатура = вт_ЛистНабораТовары.Номенклатура
	|			И вт_ЛистыНабора.ШтрихКод = вт_ЛистНабораТовары.ШК
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_ШтрихкодыУпаковокТоваров КАК вт_ШтрихкодыУпаковокТоваров
	|		ПО вт_ЛистыНабора.ЛистНабора = вт_ШтрихкодыУпаковокТоваров.Ссылка
	|			И вт_ЛистыНабора.НомерЗаказа = вт_ШтрихкодыУпаковокТоваров.НомерЗаказа
	|			И вт_ЛистыНабора.Номенклатура = вт_ШтрихкодыУпаковокТоваров.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_ЛистыНабора.ЗаказFBS,
	|	вт_ЛистыНабора.НомерЗаказаВМоделиСервиса,
	// Ихсанов Д. А. Начало 18.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
	|	вт_ЛистыНабора.НомерЗаказа,
	// Ихсанов Д. А. Конец 18.12.2025
	|	вт_ЛистыНабора.СуффиксЗаказа,
	|	вт_ШтрихкодыУпаковокТоваров.Наименование,
	|	вт_ЛистНабораТовары.ПорядковыйНомерКоробки,
	|	вт_ЛистыНабора.АртикулКонтрагента,
	|	вт_ЛистыНабора.СостояниеНакладной,
	|	вт_ЛистыНабора.СостояниеУКлиента";
	
	Возврат СтрШаблон(ТекстЗапроса, ИмяВременнойТаблицы);
	
КонецФункции // МП_ТекстЗапросаДанныеМаркировкиЗаказов()

#Область МП_ЯндексМаркет

// Ихсанов Д. А. Начало 28.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1949
// Функция - Яндекс маркет текст запроса данные маркировки заказов
// Определено в СквозноеТестирование().
//
// Параметры:
//  ИмяВременнойТаблицы	 - Строка - Имя, уже определенной в начале текста запроса, временной таблицы.
// 
// Возвращаемое значение:
//  Строка - Пакетный запрос, оканчивающийся временной таблицей.
//
Функция МП_ЯндексМаркет_ТекстЗапросаДанныеМаркировкиЗаказов(ИмяВременнойТаблицы) Экспорт 
	
	Возврат МП_ТекстЗапросаДанныеМаркировкиЗаказов(ИмяВременнойТаблицы)
	
КонецФункции // ЯндексМаркет_ТекстЗапросаДанныеМаркировкиЗаказов()
// Ихсанов Д. А. Конец  28.01.2025

// Ихсанов Д. А. Начало 28.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1949
// Функция - Яндекс маркет сформировать структуру данных по выборке
// Предназначена для маркировки товара и редактирования состава товаров в заказе
// Определено в СквозноеТестирование().
//
// Параметры:
//  Выборка					 - ВыборкаИзРезультатаЗапроса
//  ОбработанныеДанныеЗаказа - Массив, Неопределено
//  РазрешитьУдалениеТоваров - Булево
// 
// Возвращаемое значение:
//  Структура
//
Функция МП_ЯндексМаркет_СформироватьСтруктуруДанныхПоВыборке(Выборка, //ОбработанныеДанныеЗаказа...) Экспорт 
	ОбработанныеДанныеЗаказа = Неопределено, РазрешитьУдалениеТоваров = Ложь) Экспорт 
	
	// Формируем структуру коробок и кодов маркировки по товарам
	// Корень структуры - это коробки, далее товары, далее КМ
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("boxes", 		Новый Массив);
	СтруктураДанных.Вставить("allowRemove", РазрешитьУдалениеТоваров);
	
	ВыборкаИдентификатор = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИдентификатор.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаИдентификатор.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураКоробки = Новый Структура;
			СтруктураКоробки.Вставить("items", Новый Массив);
			
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("id",		  Число(ВыборкаДетальныеЗаписи.Идентификатор));
			// "instances" - Вставляется позже для контроля количества кодов маркировки
			СтруктураТовара.Вставить("fullCount", ВыборкаДетальныеЗаписи.Количество);
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КИЗ) Тогда
				СтруктураТовара.Вставить("instances", Новый Массив);
				
				ДанныеПоКодуМаркировки = Новый Структура;
				ДанныеПоКодуМаркировки.Вставить("cis", ВыборкаДетальныеЗаписи.КИЗ);
				
				СтруктураТовара.instances.Добавить(ДанныеПоКодуМаркировки)
			КонецЕсли;
			
			СтруктураКоробки.items.Добавить(СтруктураТовара);
			СтруктураДанных.boxes.Добавить(СтруктураКоробки);
			
			// Ихсанов Д. А. Начало 18.12.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-8242
			Если ОбработанныеДанныеЗаказа <> Неопределено
				И ТипЗнч(ОбработанныеДанныеЗаказа) = Тип("Массив") Тогда
				ПараметрыОтбора = Новый Структура;
				ПараметрыОтбора.Вставить("НомерЗаказа", ВыборкаДетальныеЗаписи.НомерЗаказаСИндексом);
				
				ОбработанныеДанныеЗаказа.Добавить(ПараметрыОтбора)
			КонецЕсли
			// Ихсанов Д. А. Конец 18.12.2025
		КонецЦикла
	КонецЦикла;
	
	Возврат СтруктураДанных
	
КонецФункции // ЯндексМаркет_СформироватьСтруктуруДанныхПоВыборке()
// Ихсанов Д. А. Конец  28.01.2025

#КонецОбласти

#Область МП_МагнитМаркет

// Функция - Магнит маркет текст запроса данные маркировки заказов
// Определено в СквозноеТестирование().
//
// Параметры:
//  ИмяВременнойТаблицы	 - Строка - Имя, уже определенной в начале текста запроса, временной таблицы.
// 
// Возвращаемое значение:
//  Строка - Пакетный запрос, оканчивающийся временной таблицей.
//
Функция МП_МагнитМаркет_ТекстЗапросаДанныеМаркировкиЗаказов(ИмяВременнойТаблицы) Экспорт 
	
	Возврат МП_ТекстЗапросаДанныеМаркировкиЗаказов(ИмяВременнойТаблицы)
	
КонецФункции // ЯндексМаркет_ТекстЗапросаДанныеМаркировкиЗаказов()

// Функция - Магнит маркет сформировать структуру данных по выборке
// Предназначена для маркировки товара и редактирования состава товаров в заказе
// Определено в СквозноеТестирование().
//
// Параметры:
//  Выборка					 - ВыборкаИзРезультатаЗапроса
//  ОбработанныеДанныеЗаказа - Массив, Неопределено
//  РазрешитьУдалениеТоваров - Булево
// 
// Возвращаемое значение:
//  Структура
//
Функция МП_МагнитМаркет_СформироватьСтруктуруДанныхПоВыборке(Выборка, //ОбработанныеДанныеЗаказа...) Экспорт 
	ОбработанныеДанныеЗаказа = Неопределено) Экспорт 
	
	// Формируем структуру коробок и кодов маркировки по товарам
	// Корень структуры - это коробки, далее товары, далее КМ
	ДанныеДляJSON = Новый Структура;
	ДанныеДляJSON.Вставить("order_id", Выборка.НомерЗаказа);
	ДанныеДляJSON.Вставить("parcels",	 Новый Массив);
	
	ВыборкаИдентификатор = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИдентификатор.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаИдентификатор.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураКоробки = Новый Структура;
			СтруктураКоробки.Вставить("items", Новый Массив);
			
			СтруктураТовара = Новый Структура;
			СтруктураТовара.Вставить("sku_id",	  Число(ВыборкаДетальныеЗаписи.Идентификатор));
			СтруктураТовара.Вставить("quantity", ВыборкаДетальныеЗаписи.Количество);
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КИЗ) Тогда
				СтруктураТовара.Вставить("identifiers", Новый Массив);
				
				ДанныеПоКодуМаркировки = Новый Структура;
				ДанныеПоКодуМаркировки.Вставить("cis", ВыборкаДетальныеЗаписи.КИЗ);
				
				СтруктураТовара.identifiers.Добавить(ДанныеПоКодуМаркировки);
			КонецЕсли;
			
			СтруктураКоробки.items.Добавить(СтруктураТовара);
			ДанныеДляJSON.parcels.Добавить(СтруктураКоробки);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДанныеДляJSON;
	
КонецФункции // МП_МагнитМаркет_СформироватьСтруктуруДанныхПоВыборке()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МП_ЯндексМаркет

// Ихсанов Д. А. Начало 28.01.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1949
// Функция - Яндекс маркет состояние промаркированной продукции
// Определено в СквозноеТестирование().
// 
// Возвращаемое значение:
//  СправочникСсылка.СостояниеНакладнойУКлиента
//
Функция МП_ЯндексМаркет_СостояниеПромаркированнойПродукции()
	
	// РЕФАКТОРИНГ - ПОИСК НЕВЕРНЫЙ, ЕГО НУЖНО ПОЛУЧАТЬ БЕЗ ХАРДКОДА
	Возврат Справочники.СостояниеНакладнойУКлиента.НайтиПоНаименованию("CUSTOM;MARKED");
	
КонецФункции // ЯндексМаркет_СостояниеПромаркированнойПродукции()
// Ихсанов Д. А. Конец  28.01.2025

// Ихсанов Д. А. Начало 25.03.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-1102
// Функция - Яндекс маркет состояние промаркированной продукции
// Определено в СквозноеТестирование().
// 
// Возвращаемое значение:
//  СправочникСсылка.СостояниеНакладнойУКлиента
//
Функция МП_МагнитМаркет_СостояниеПромаркированнойПродукции()
	
	// РЕФАКТОРИНГ - ПОИСК НЕВЕРНЫЙ, ЕГО НУЖНО ПОЛУЧАТЬ БЕЗ ХАРДКОДА
	Возврат Справочники.СостояниеНакладнойУКлиента.НайтиПоКоду(57);
	
КонецФункции // ЯндексМаркет_СостояниеПромаркированнойПродукции()
// Ихсанов Д. А. Конец  25.03.2025

#КонецОбласти

#КонецОбласти
